samuelclay/turntouch-remote/firmware/nrf51/src/main.c
/* Copyright 2015 Turn Touch. All rights reserved.
 * 
 * This is the main sequence for the Turn Touch Remote.
 * 
 * Includes:
 *   - 4 button GPIOs
 *   - Pin interrupts on buttons
 *   - Timer to watch for long presses to signal mode changes
 *   - Bluetooth Softdevice stack
 * 
 */

#include <stdbool.h>
#include <stdint.h>
#include "app_error.h"
#include "app_scheduler.h"
#include "app_timer.h"
#include "app_timer_appsh.h"
#include "app_trace.h"
#include "ble.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "boards.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "button_status.h"
#include "device_manager.h"
#include "nordic_common.h"
#include "nrf.h"
#include "nrf51_bitfields.h"
#include "nrf_drv_gpiote.h"
#include "nrf_error.h"
#include "nrf_gpio.h"
#include "pstorage.h"
#include "rtt.h"
#include "softdevice_handler.h"


#define APP_TIMER_PRESCALER      0                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_MAX_TIMERS     (2 + BSP_APP_TIMERS_NUMBER) /**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE  4                           /**< Size of timer operation queues. */
#define APP_FEATURE_NOT_SUPPORTED            BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2                    /**< Reply when unsupported features are requested. */

// #define BUTTON_PREV_ID           0                           /**< Button used to switch the state. */
// #define BUTTON_NEXT_ID           1                           /**< Button used to switch the state. */
// #ifdef BSP_BUTTON_0
//     #define PIN_IN BSP_BUTTON_0
// #endif
// #ifndef PIN_IN
//     #error "Please indicate input pin"
// #endif
//
// #ifdef BSP_LED_0
//     #define PIN_OUT BSP_LED_0
// #endif
// #ifndef PIN_OUT
//     #error "Please indicate output pin"
// #endif


#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/

#define DEVICE_NAME                     "Turn Touch Remote"                           /**< Name of device. Will be included in the advertising data. */

#define APP_ADV_FAST_INTERVAL           40                                          /**< The advertising interval (in units of 0.625 ms). The default value corresponds to 25 ms. */
#define APP_ADV_SLOW_INTERVAL           3200                                        /**< Slow advertising interval (in units of 0.625 ms). The default value corresponds to 2 seconds. */
#define APP_ADV_FAST_TIMEOUT            180                                         /**< The advertising time-out in units of seconds. */
#define APP_ADV_SLOW_TIMEOUT            180                                         /**< The advertising time-out in units of seconds. */
#define ADV_INTERVAL_FAST_PERIOD        30                                          /**< The duration of the fast advertising period (in seconds). */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (0.5 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)           /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                   4                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds). */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                  1                                           /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                           /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                        /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                           /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                           /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                          /**< Maximum encryption key size. */
#define MEM_BLOCK_SIZE                  54                                          /**< Maximum length (an example) for write long, according to https://devzone.nordicsemi.com/documentation/nrf51/5.1.0/html/a01222.html */
#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

// YOUR_JOB: Modify these according to requirements (e.g. if other event types are to pass through
//           the scheduler).
#define SCHED_MAX_EVENT_DATA_SIZE       sizeof(app_timer_event_t)                   /**< Maximum size of scheduler events. Note that scheduler BLE stack events do not contain any data, as the events are being pulled from the stack in the event handler. */
#define SCHED_QUEUE_SIZE                10                                          /**< Maximum number of events in the scheduler queue. */

static ble_gap_sec_params_t             m_sec_params;                               /**< Security requirements for this application. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */
static ble_buttonservice_t              m_buttonservice;
static dm_application_instance_t        m_app_handle;                                  /**< Application identifier allocated by device manager. */
static dm_handle_t                      m_bonded_peer_handle;                          /**< Device reference handle to the current bonded central. */
static ble_user_mem_block_t             m_mem_block;                                /**< Memory block structure, used during a BLE_EVT_USER_MEM_REQUEST event. */
static ble_gatts_rw_authorize_reply_params_t    m_rw_authorize_reply;               /**< Authorize reply structure, used during BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST event. */
static uint8_t                          m_mem_queue[MEM_BLOCK_SIZE];                /**< Memory block for m_mem_block */

static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static void sleep_mode_enter(void);
static void ble_evt_dispatch(ble_evt_t * p_ble_evt);
static void on_ble_evt(ble_evt_t * p_ble_evt);

// ===========
// = Buttons =
// ===========

void bsp_evt_handler(bsp_event_t evt) {
    
    if (evt == BSP_EVENT_KEY_0 ||
        evt == BSP_EVENT_KEY_1 ||
        evt == BSP_EVENT_KEY_2 ||
        evt == BSP_EVENT_KEY_3 ||
        evt == BSP_EVENT_KEY_4 ||
        evt == BSP_EVENT_KEY_5 ||
        evt == BSP_EVENT_KEY_6 ||
        evt == BSP_EVENT_KEY_7) {
        uint32_t err_code;
        bool pushed;
        uint8_t button_state[BUTTON_STATUS_PACKET_BYTES] = {0x0F, 0x00};
        bool mode_change;
        switch (evt)
        {
            case BSP_EVENT_KEY_4:            
            case BSP_EVENT_KEY_5:
            case BSP_EVENT_KEY_6:
            case BSP_EVENT_KEY_7:
                mode_change = true;
                break;
            default:
                break;
        }
    
        // Button down
        if ((evt == BSP_EVENT_KEY_0) || mode_change) {
            app_button_is_pushed(0, &pushed);
            if (pushed) {
                button_state[0] ^= (1 << 0);
                LEDS_ON(BSP_LED_0_MASK);
            } else {
                button_state[0] |= (1 << 0);
                LEDS_OFF(BSP_LED_0_MASK);
            }
        }
        if ((evt == BSP_EVENT_KEY_1) || mode_change) {
            app_button_is_pushed(1, &pushed);
            if (pushed) {
                button_state[0] ^= (1 << 1);
                LEDS_ON(BSP_LED_1_MASK);
            } else {
                button_state[0] |= (1 << 1);
                LEDS_OFF(BSP_LED_1_MASK);
            }
        }
        if ((evt == BSP_EVENT_KEY_2) || mode_change) {
            app_button_is_pushed(2, &pushed);
            if (pushed) {
                button_state[0] ^= (1 << 2);
                LEDS_ON(BSP_LED_2_MASK);
            } else {
                button_state[0] |= (1 << 2);
                LEDS_OFF(BSP_LED_2_MASK);
            }
        }
        if ((evt == BSP_EVENT_KEY_3) || mode_change) {
            app_button_is_pushed(3, &pushed);
            if (pushed) {
                button_state[0] ^= (1 << 3);
                LEDS_ON(BSP_LED_3_MASK);
            } else {
                button_state[0] |= (1 << 3);
                LEDS_OFF(BSP_LED_3_MASK);
            }
        }
    
