samuelclay/turntouch-remote/firmware/nrf51/src/main.c
        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
            rtt_print(0, "%sConnection params update\n", RTT_CTRL_TEXT_BLUE);
            break;
            
        case BLE_GATTS_EVT_WRITE:
            p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
            rtt_print(0, "%sGatt written to by client: %s%X\n", RTT_CTRL_TEXT_BLUE, RTT_CTRL_TEXT_BRIGHT_BLUE, p_evt_write);
            break;

        case BLE_EVT_USER_MEM_REQUEST:
            rtt_print(0, "%sBluetooth user mem request (%X)\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gap_evt.conn_handle);
            m_mem_block.p_mem = &m_mem_queue[0];
            m_mem_block.len = MEM_BLOCK_SIZE;
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gap_evt.conn_handle, &m_mem_block);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_EVT_USER_MEM_RELEASE:
            rtt_print(0, "%sBluetooth user mem release (%X, %X)\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gap_evt.conn_handle, *((uint16_t *)m_mem_block.p_mem));
            if (p_ble_evt->evt.common_evt.params.user_mem_release.mem_block.p_mem == m_mem_block.p_mem) {
            
            }
            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
            rtt_print(0, "%sBluetooth RW authorize request: %X == %X/%x, %X\n", RTT_CTRL_TEXT_BLUE, p_ble_evt->evt.gatts_evt.params.write.op, BLE_GATTS_OP_PREP_WRITE_REQ, BLE_GATTS_OP_EXEC_WRITE_REQ_NOW, p_ble_evt->evt.gatts_evt.params.write.data[0]);
            m_rw_authorize_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
            m_rw_authorize_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
            
            err_code = sd_ble_gatts_rw_authorize_reply(m_conn_handle, &m_rw_authorize_reply);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            rtt_print(0, "%sBluetooth event unhandled: %s%X(%d)%s\n", RTT_CTRL_TEXT_BLUE, RTT_CTRL_TEXT_BRIGHT_BLUE, p_ble_evt->header.evt_id, p_ble_evt->header.evt_len, RTT_CTRL_RESET);
            break;
    }
}

// ============
// = Services =
// ============

static void firmware_nickname_write_handler(ble_buttonservice_t *p_buttonservice, uint16_t* nickname) {
    // ble_gatts_value_t gatts_value;
    // uint8_t  cccd_value_buf[FIRMWARE_NICKNAME_MAX_LENGTH];
    // uint32_t err_code;
    
    // // Initialize value struct.
    // memset(&gatts_value, 0, sizeof(gatts_value));
    //
    // gatts_value.len     = FIRMWARE_NICKNAME_MAX_LENGTH;
    // gatts_value.offset  = 0;
    // gatts_value.p_value = cccd_value_buf;
    //
    // err_code = sd_ble_gatts_value_get(p_buttonservice->conn_handle,
    //                                   p_buttonservice->firmware_nickname_char_handles.cccd_handle,
    //                                   &gatts_value);
    // if (err_code == NRF_SUCCESS)
    // {
    //     nickname = gatts_value.p_value;
        rtt_print(0, "%s%sNew nickname :: %s%X - %X%s\n", RTT_CTRL_BG_BLUE, RTT_CTRL_TEXT_BRIGHT_WHITE,
                  RTT_CTRL_TEXT_BRIGHT_GREEN, nickname, nickname[8], RTT_CTRL_RESET);
    // } else {
    //     rtt_print(0, "Nickname error: %X, %X\n", err_code, gatts_value.p_value[8]);
    //     for (int i=0;i < gatts_value.len; i++) {
    //         SEGGER_RTT_printf(0, "%X", gatts_value.p_value[i]);
    //     }
    // }
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t err_code;
    ble_buttonstatus_init_t init;
    char nickname[FIRMWARE_NICKNAME_MAX_LENGTH];

    init.firmware_nickname_write_handler = firmware_nickname_write_handler;

    strcpy(nickname, "\0");
    memset(init.nickname_str, 0, FIRMWARE_NICKNAME_MAX_LENGTH);
    strcpy(init.nickname_str, nickname);
    rtt_print(0, "Setting nickname: %s/%s (%d)\n", nickname, init.nickname_str, strlen(nickname));
    
    err_code = ble_buttonstatus_init(&m_buttonservice, &init);
    APP_ERROR_CHECK(err_code);
}

// =========
// = Power =
// =========

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, true);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    rtt_print(0, "%sSleeping...%s\n", RTT_CTRL_TEXT_BRIGHT_RED, RTT_CTRL_RESET);

    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;

    rtt_print(0, "%s%sStarting up Turn Touch Remote%s\n", RTT_CTRL_TEXT_BRIGHT_YELLOW,
                                                          RTT_CTRL_BG_BRIGHT_MAGENTA, 
                                                          RTT_CTRL_RESET);
    
    // Initialize buttons
    // clock_initialization();
    timers_init();
    bsp_configuration();

    // Initialize
    ble_stack_init();
    scheduler_init();
    device_manager_init();
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    sec_params_init();

    // Start execution
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    // err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    // APP_ERROR_CHECK(err_code);

    while (true)
    {
        app_sched_execute();
        // power_manage();
    }
}


/**
 * @}
 */
